app/controllers/comments_controller.rb

 def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment].permit(:commenter, :body))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "7"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "go"], ["commenter", "santia"], ["created_at", Tue, 02 Jul 2013 01:10:46 UTC +00:00], ["post_id", 7], ["updated_at", Tue, 02 Jul 2013 01:10:46 UTC +00:00]]