app/controllers/posts_controller.rb

 def create
  #@post = Post.new(post_params)
  @post = Post.new(params[:post].permit(:title, :text))

  if @post.save
---
INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 01 Jul 2013 22:20:07 UTC +00:00], ["text", "b"], ["title", "a"], ["updated_at", Mon, 01 Jul 2013 22:20:07 UTC +00:00]]

 def show
  @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 7]]

 def update
  @post = Post.find(params[:id])

  if @post.update(params[:post].permit(:title, :text))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = 5  [["title", "samanth"], ["updated_at", Tue, 02 Jul 2013 00:38:44 UTC +00:00]]